# applications
cask '1password'
cask 'alfred'
cask 'alt-tab'
cask 'firefox'
cask 'flameshot'
cask 'keybase'
cask 'rectangle'
cask 'spotify'
cask 'vlc'

# aws
brew 'awscli'
brew 'aws-vault'

# runtime management
brew 'asdf'

# terminal tools
brew 'autojump'
brew 'bat'
brew 'btop'
brew 'curl'
brew 'diff-so-fancy'
brew 'difftastic'
brew 'dust'
brew 'eza'
brew 'fzf'
brew 'git-delta'
brew 'jq'
brew 'ncdu'
brew 'prettyping'
brew 'ripgrep'
brew 'rpl'
brew 'tig'
brew 'tlrc'
brew 'tree'
brew 'vale'
brew 'watch'

# terminals and editors
brew 'neovim'
brew 'tmux'
cask 'wezterm'

# version control
brew 'git'
