# vim: set ft=brewfile

# applications
cask 'alfred'
cask 'alt-tab'
cask 'firefox'
cask 'rectangle'
cask 'spotify'
cask 'tailscale'
cask 'vlc'

# fonts
brew 'fontconfig'
cask 'font-hasklig'
cask 'font-meslo-for-powerline'
cask 'font-meslo-lg'
cask 'font-meslo-lg-dz'
cask 'font-meslo-lg-nerd-font'
cask 'font-symbols-only-nerd-font'

# linters
brew 'shfmt'

# runtime management
brew 'asdf'

# terminal tools
brew 'autojump'
brew 'bat'
brew 'btop'
brew 'curl'
brew 'diff-so-fancy'
brew 'difftastic'
brew 'dust'
brew 'eza'
brew 'fzf'
brew 'git-delta'
brew 'jq'
brew 'lazygit'
brew 'ncdu'
brew 'prettyping'
brew 'ripgrep'
brew 'rpl'
brew 'tig'
brew 'tlrc'
brew 'tree'
brew 'vale'
brew 'watch'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

# terminals and editors
brew 'neovim'
brew 'tmux'
cask 'wezterm'

# version control
brew 'git'
